{
  "id": "1",
  "title": "THE LAST MORNING",
  "thread": "yuna",
  "layer": 0,
  "content": "<p class=\"narrative\">The morning Seoul dies, you wake up late for work.</p>\n\n<p class=\"narrative\">Your alarm didn't go off. Or maybe it did—maybe you slept through it, the way you've been sleeping through everything since Minho left. Six months of dreamless unconsciousness, your body's way of protecting you from the waking hours when you'd have to remember that he's gone.</p>\n\n<p class=\"narrative\">The apartment is cold. December cold, the kind that seeps through walls no matter how high you crank the ondol. You reach for your phone on the nightstand and the screen lights up with a violence that makes you wince.</p>\n\n<p class=\"narrative\">Seventeen missed calls from an unknown number. Three from your mother—which is strange, because your mother never calls anymore, not since the fight about Minho, about your choices, about the way you've arranged your life like a museum exhibit: carefully curated, untouchable, alone. Two from your boss at the Leeum. One from a number you don't recognize.</p>\n\n<p class=\"narrative\">And it's 10:47 AM. You were supposed to open the East Asian ceramics wing three hours ago.</p>\n\n<p class=\"narrative\">You sit up. The movement sends blood rushing to your head, a pulse of vertigo that makes the room tilt. When was the last time you ate? Yesterday? The day before? The refrigerator has been empty for a week, but you keep forgetting to care.</p>\n\n<p class=\"narrative\">The television is on. You don't remember leaving it on. The news anchor is—</p>\n\n<p class=\"narrative\">The news anchor is crying.</p>\n\n<p class=\"narrative\">You've never seen a news anchor cry. Not during the Sewol Ferry disaster. Not during the impeachment. Not during any of the small apocalypses that have punctuated Korean life for as long as you've been alive. But this woman—middle-aged, professional, her makeup running in dark tracks down her cheeks—is sobbing into her microphone while behind her, footage plays of something you can't quite process.</p>\n\n<p class=\"narrative\">People running. That's the first thing you understand. People running through streets you recognize—Myeongdong, the shopping district, the place where you and Minho had your third date, where he bought you that ridiculous hat and you wore it anyway because he laughed.</p>\n\n<p class=\"narrative\">But they're not running like shoppers late for a sale. They're running like prey.</p>\n\n<p class=\"narrative\">And behind them—</p>\n\n<p class=\"dialogue\">\"—advised to stay indoors. Do not approach anyone exhibiting symptoms. The infection spreads through—\"</p>\n\n<p class=\"narrative\">Static. The image tears, fragments, reforms into a test pattern. The anchor's sobs cut off mid-breath.</p>\n\n<p class=\"narrative\">You stand. Your legs feel like they belong to someone else. The window—you should look out the window. See what's actually happening. See if this is real or if you're still dreaming, if the six months of numbness have finally cracked your mind open like an egg.</p>\n\n<p class=\"narrative\">You don't look out the window.</p>\n\n<p class=\"narrative\">Instead, you stand there in your ratty t-shirt and underwear, holding your phone like a lifeline, listening to the sounds filtering through the walls of your fifth-floor apartment. Someone screaming three floors up. A crash—glass, maybe, or furniture. A dog barking with the kind of sustained hysteria that means it's not going to stop. Car alarms. So many car alarms, layered on top of each other like a symphony of panic.</p>\n\n<p class=\"narrative\">Your phone buzzes. Unknown number. Your thumb moves before your brain catches up, and suddenly there's a voice in your ear—a voice you'd recognize in a crowd of thousands, a voice that still appears in your dreams, saying words you can't remember when you wake.</p>\n\n<p class=\"dialogue\">\"Yuna.\"</p>\n\n<p class=\"narrative\">Your breath stops. Actually stops, the air caught somewhere in your chest like a fist.</p>\n\n<p class=\"dialogue\">\"Minho.\"</p>\n\n<p class=\"narrative\">Six months of silence. Six months of blocked numbers and returned letters and the slow, grinding acceptance that whatever you had was over—not with a bang, but with the whimper of him taking a job in Tokyo and you staying behind, neither of you willing to say what needed to be said.</p>\n\n<p class=\"narrative\">And now his voice, rough with static and something else—fear, maybe, or exhaustion—asking:</p>\n\n<p class=\"dialogue\">\"Where are you? Are you safe?\"</p>\n\n<p class=\"narrative\">You open your mouth. Close it. The words feel impossibly far away, lodged somewhere in the frozen machinery of your throat.</p>\n\n<p class=\"dialogue\">\"I'm—I'm in my apartment. Minho, what's—\"</p>\n\n<p class=\"dialogue\">\"Listen to me.\"</p>\n\n<p class=\"narrative\">His voice has that edge it used to get when he was serious, when he stopped being the charming boy with the easy smile and became the soldier he'd trained to be for two years of mandatory service. The voice that could cut through panic. The voice that, once upon a time, made you feel safe.</p>\n\n<p class=\"dialogue\">\"Don't go outside. Barricade your door. Lock the windows. Don't open for anyone you don't know. I'm coming for you.\"</p>\n\n<p class=\"narrative\">A crash on his end. Glass shattering. Someone screaming—not words, just sound, the kind of sound humans make when language fails them.</p>\n\n<p class=\"dialogue\">\"I'm in Itaewon. I can be there in—\"</p>\n\n<p class=\"narrative\">The line dies.</p>\n\n<p class=\"narrative\">You stare at the phone. The screen shows CALL ENDED, the duration a flat 47 seconds. Less than a minute. Less than a minute to overturn six months of grief and silence, to hear his voice and feel that old familiar hook in your chest, the one that always pulled you toward him no matter how hard you tried to swim away.</p>\n\n<p class=\"narrative thought\">He's coming for you. After everything. After the silence and the distance and the way he broke you like a falling star—brief and brilliant and beautiful, burning itself up to make someone else's wish come true at the cost of its own light.</p>\n\n<p class=\"narrative thought\">He's <em>coming for you</em>.</p>\n\n<p class=\"narrative\">Something moves through your chest. Hot. Complicated. You don't have time to name it—not love, not anger, not hope, just some tangled combination of all three that makes your hands shake.</p>\n\n<p class=\"narrative\">The pounding starts on Mrs. Park's door.</p>\n\n<p class=\"narrative\">You hear it clearly through the thin apartment walls—not a knock, but a pounding. Rhythmic. Insistent. The kind of pounding that doesn't stop, that doesn't tire, that isn't asking permission.</p>\n\n<p class=\"narrative\">Mrs. Park is eighty-three years old. She makes kimchi jjigae every Sunday and brings you a bowl whether you want it or not. She's been widowed for fifteen years and she still sets a place at her table for her husband. She calls you \"dear\" and pretends not to notice when your eyes are red from crying.</p>\n\n<p class=\"narrative\">The pounding gets louder. Something splinters. Mrs. Park screams—not a scream of surprise, but a scream of terror, the kind that comes from the throat without the brain's permission.</p>\n\n<p class=\"narrative\">You're still holding the phone. Still standing in your underwear. Still frozen.</p>\n\n<p class=\"narrative\">Minho said to barricade the door. Minho said to stay inside. Minho, who is forty minutes away in Itaewon, who might not even make it through whatever is happening in those streets you glimpsed on the television.</p>\n\n<p class=\"narrative\">But Mrs. Park is twenty feet away, and she's screaming, and the pounding has stopped which means whatever was on the other side of her door is now <em>inside</em>.</p>\n\n<p class=\"narrative\">You have maybe thirty seconds to decide who you're going to be in this new world. The person who hides. The person who waits. Or the person who opens the door.</p>\n\n<p class=\"narrative\">The fire extinguisher hangs on the wall by the kitchen. Heavy. Metal. Not a weapon, but close enough. In the drawer, there's a knife—the good one, the one you bought at Namdaemun Market because the ajumma swore it could cut through bone.</p>\n\n<p class=\"narrative\">Mrs. Park has stopped screaming. The silence is worse.</p>\n\n<p class=\"narrative\">What do you do?</p>",
  "choices": [
    {
      "text": "Help Mrs. Park. You can't leave an old woman to die.",
      "target": 2,
      "flags": { "chose_compassion": true }
    },
    {
      "text": "Barricade your door. Survival first. Minho said to stay.",
      "target": 3,
      "flags": { "chose_caution": true }
    },
    {
      "text": "Grab a weapon and go. Don't wait to be saved.",
      "target": 4,
      "flags": { "chose_action": true }
    }
  ]
}
