{
  "id": "2",
  "title": "THE NEIGHBOR",
  "thread": "yuna",
  "layer": 1,
  "content": "<p class=\"narrative\">The hallway stretches forever. Twenty steps. Maybe thirty. Your feet are bare on the cold tile and you're still in your underwear and a t-shirt and none of that matters because Mrs. Park has stopped screaming.</p>\n\n<p class=\"narrative\">The fire extinguisher is heavy in your hands. Red. Cold. The kind of weight that makes your arms ache after thirty seconds. You hold it like a club, like a promise, like the only thing standing between you and whatever is happening behind that splintering door.</p>\n\n<p class=\"narrative\">The hallway lights flicker. Emergency power, maybe—the building's generator kicking in. Or maybe the grid is failing. You don't know. You don't care. All you know is that each step brings you closer to a door that's shaking in its frame, hinges screaming, cheap wood splintering around a lock that was never meant to hold against anything more determined than a gust of wind.</p>\n\n<p class=\"narrative\">You count the doors as you pass. 502—the young couple who fight every weekend and make up by Monday. 503—empty for months, the owner overseas. 504—Mr. Cho, the accountant who complains about your music and leaves passive-aggressive notes about recycling. His door is open. Just a crack. Just enough to see darkness inside, and something wet on the floor that catches the flickering light.</p>\n\n<p class=\"narrative\">You don't stop. You can't stop.</p>\n\n<p class=\"narrative\">Mrs. Park's door gives just as you reach it. The wood around the deadbolt tears away in long splinters, and something pushes through—something that used to be human, that might still be wearing human clothes, but moves wrong. All wrong.</p>\n\n<p class=\"narrative\">It's Mr. Cho.</p>\n\n<p class=\"narrative\">You recognize the cardigan first. Brown wool, the one he wore every day, the one his wife bought him before she died. Then the hands—long fingers, accountant's hands, now curved into claws and streaked with something dark. Then the face.</p>\n\n<p class=\"narrative\">His jaw hangs loose. Not broken—<em>detached</em>, connected to his skull by strings of meat and tendon, swinging with each movement like a grotesque pendulum. His eyes are filmed over, milky white, but somehow they're tracking. Hunting. <em>Seeing</em>.</p>\n\n<p class=\"narrative\">The smell hits you like a physical force. Copper and rot and something else—something sweet, cloying, the smell of fruit left too long in the sun. Your stomach lurches. You swallow bile.</p>\n\n<p class=\"narrative\">Behind him, Mrs. Park is pressed against her kitchen counter. Blood on her hands—her own blood, you realize, from a wound on her arm that's still seeping through the kitchen towel she's pressed against it. A broken vase lies at her feet, ceramic shards scattered across the linoleum like fallen teeth.</p>\n\n<p class=\"narrative\">She's not screaming anymore. She's past screaming. Her eyes meet yours across the small apartment, and in them you see something you never expected from this woman who survived the war, who buried a husband and two children, who kept setting a place at her table for a man who'd been dead for fifteen years.</p>\n\n<p class=\"narrative\">You see hope.</p>\n\n<p class=\"narrative\">Mr. Cho turns. His head cocks at an angle that would be impossible for a living neck—forty-five degrees, maybe more, like a dog hearing a distant sound. His milky eyes find you. Fix on you.</p>\n\n<p class=\"narrative\">Recognition? Hunger? You'll never know which. Maybe there's no difference anymore.</p>\n\n<p class=\"narrative\">He takes a step toward you. Then another. His legs work wrong—stiff, jerky, like he's forgotten how knees are supposed to bend. But he's fast. Faster than he should be. Faster than a seventy-year-old accountant has any right to move.</p>\n\n<p class=\"narrative\">The fire extinguisher suddenly feels very small.</p>\n\n<p class=\"narrative\">Mrs. Park is behind him. Cornered. If he turns back to her—if he finishes what he started—</p>\n\n<p class=\"narrative\">Your hands are shaking. Your whole body is shaking. But somewhere deep in your brain, past the fear and the nausea and the screaming animal instinct to run, something else is waking up. Something older. Something that knows, with absolute certainty, that you didn't come this far to watch an old woman die.</p>\n\n<p class=\"narrative\">Mr. Cho is five feet away. Four. His jaw swings. His hands reach. His breath rattles through a throat that's half-collapsed, a wet gurgling sound that will haunt you for the rest of your life, however long or short that might be.</p>\n\n<p class=\"narrative\">You have maybe two seconds to decide. The fire extinguisher in your hands. The trigger that could spray foam into his face. The weight that could cave in his skull.</p>\n\n<p class=\"narrative\">Behind him, Mrs. Park is moving. You see it in your peripheral vision—the knife block on her counter, her bloody hand reaching for the biggest blade. But she's too slow. She's eighty-three years old and she's been bitten and she's <em>too slow</em>.</p>\n\n<p class=\"narrative\">Unless you buy her time.</p>\n\n<p class=\"narrative\">What do you do?</p>",
  "choices": [
    {
      "text": "Swing the extinguisher at his head. Hard. Put him down.",
      "target": "2_attack",
      "flags": { "killed_cho": true, "chose_violence": true }
    },
    {
      "text": "Spray him in the face. Blind him. Give Mrs. Park her chance.",
      "target": "2_spray",
      "flags": { "disabled_cho": true, "teamwork": true }
    },
    {
      "text": "Scream. Draw his attention. Let her strike while he comes for you.",
      "target": "2_distract",
      "flags": { "self_sacrifice": true, "teamwork": true }
    }
  ]
}
