{
  "id": "3",
  "title": "THE BARRICADE",
  "thread": "minho",
  "layer": 1,
  "content": "<p class=\"narrative\">You barricade the door.</p>\n\n<p class=\"narrative\">The bookshelf goes first—heavy oak, inherited from your grandmother, the one she dragged across three provinces during the war because it held her mother's tea set and her father's poetry books. You've never moved it, not in three years of living here, and your arms scream as you shove it against the door. The tea set rattles. The poetry books spill. You don't care.</p>\n\n<p class=\"narrative\">Then the desk. Then the mattress. Then every piece of furniture that isn't bolted to the floor, piled against the door in a monument to fear that would be almost funny if you could remember how to laugh.</p>\n\n<p class=\"narrative\">The window faces the street. Five floors up. You could look—could see what's happening, could understand the scope of whatever this is—but you don't. You can't. The sounds are enough.</p>\n\n<p class=\"narrative\">Car alarms. Dozens of them. Screaming—human and otherwise. Glass shattering. Something that might be gunfire, far away. And beneath it all, a low, constant roar, like a stadium crowd or a wildfire or the collective panic of eight million people discovering that the world they knew is over.</p>\n\n<p class=\"narrative\">You sit with your back against the barricade. Your phone shows 23% battery. You've refreshed the news until it stopped loading, watched the little spinning circle go round and round until the connection died completely. The last update said the government was evacuating Gangnam. That was two hours ago. Or three. You're not sure anymore.</p>\n\n<p class=\"narrative\">Time stops meaning anything when the world ends.</p>\n\n<p class=\"narrative\">Minho hasn't texted again. You've tried calling—seventeen times, each one going straight to voicemail, his recorded voice saying <em>\"This is Park Minho. Leave a message and I'll call you back.\"</em> Cheerful. Professional. The voice of a man who existed before today.</p>\n\n<p class=\"narrative\">You leave seven messages. The first is coherent. The seventh is just crying.</p>\n\n<p class=\"narrative\">Mrs. Park's apartment has been quiet for hours. You don't know what that means. You're afraid you do know what that means.</p>\n\n<p class=\"narrative\">At some point, you fall asleep. You don't mean to—who sleeps through the apocalypse?—but your body makes the decision for you, dragging you down into darkness like a stone sinking into deep water.</p>\n\n<p class=\"narrative\">You dream of Minho. The night before he left for Tokyo. The two of you on the rooftop of his building, sharing a bottle of soju, not talking about what was coming. His hand found yours. His eyes found yours.</p>\n\n<p class=\"dialogue\">\"Come with me.\"</p>\n\n<p class=\"narrative\">You wake to knocking.</p>\n\n<p class=\"narrative\">Not the frenzied pounding from before—the mindless, insistent hammering that came from Mrs. Park's door, from other doors, from everywhere at once. This is different. Three precise raps. Patient. <em>Human</em>.</p>\n\n<p class=\"dialogue\">\"Yuna?\"</p>\n\n<p class=\"narrative\">Your heart stops. Actually stops, the muscle seizing in your chest for one eternal second before slamming back to life so hard you think you might throw up.</p>\n\n<p class=\"dialogue\">\"Yuna, are you there?\"</p>\n\n<p class=\"narrative\">His voice. Through the door. Through the bookshelf and the desk and the mattress and all the barriers you've built to keep the world out.</p>\n\n<p class=\"narrative\">Minho is here.</p>\n\n<p class=\"narrative\">Minho, who was forty minutes away in Itaewon. Minho, who hasn't answered his phone in hours. Minho, who left you six months ago because Tokyo had opportunities and Seoul had only you.</p>\n\n<p class=\"narrative\">Minho is <em>here</em>.</p>\n\n<p class=\"narrative\">You scramble to your feet. Your hands find the bookshelf, ready to push, ready to tear down everything you've built because he came back, he actually came back, he—</p>\n\n<p class=\"narrative\">You stop.</p>\n\n<p class=\"narrative\">The news said the infection spreads through bites. The news said the infected can look normal, at first. The news said—</p>\n\n<p class=\"narrative\">The news said a lot of things before it went silent.</p>\n\n<p class=\"dialogue\">\"Yuna?\"</p>\n\n<p class=\"narrative\">His voice sounds right. Sounds like him. But through a door, through walls, how can you be sure? How can you know that the thing on the other side is the man you loved and not something wearing his face?</p>\n\n<p class=\"narrative\">Your phone is dead. You can't call him. Can't verify. Can't do anything but stand here with your hands on your grandmother's bookshelf, frozen between hope and terror.</p>\n\n<p class=\"narrative\">What do you do?</p>",
  "choices": [
    {
      "text": "Tear down the barricade. It's him. You know it's him.",
      "target": "3_open_fast",
      "flags": { "immediate_trust": true, "minho_reunited": true }
    },
    {
      "text": "\"How do I know it's really you?\" Test him. Make him prove it.",
      "target": "3_verify",
      "flags": { "cautious": true }
    },
    {
      "text": "Stay silent. Watch the door. Wait and see what he does.",
      "target": "3_silent",
      "flags": { "paranoid": true }
    }
  ]
}
