{
  "id": "4",
  "title": "THE ARMORY",
  "thread": "yuna",
  "layer": 1,
  "content": "<p class=\"narrative\">You don't wait. You don't hide. You arm up.</p>\n\n<p class=\"narrative\">The kitchen drawer sticks—it always sticks, you've been meaning to fix it for two years—but you yank it open with a violence that sends utensils scattering across the counter. Forks, spoons, the can opener you've used twice, and there, at the back, the knife. The good knife. The one you bought at Namdaemun Market three years ago because the ajumma swore on her grandmother's grave that the blade could cut through bone.</p>\n\n<p class=\"narrative\">You never tested that claim. You used it for vegetables, mostly. For the rare occasions when you cooked instead of ordering delivery. For the life of a museum curator in a modern city, where violence happened to other people in other places.</p>\n\n<p class=\"narrative\">You hope she was telling the truth.</p>\n\n<p class=\"narrative\">Under the bed. The baseball bat from college. You never played—never even liked the sport—but you bought it after that night walking home from the subway, the man following too close, his footsteps matching yours for six blocks until you ducked into a convenience store and waited for an hour. The next day you bought the bat. Kept it under the bed. Told yourself you'd use it if you had to.</p>\n\n<p class=\"narrative\">The metal feels cold in your hands. Heavy. Real. The kind of weight that promises consequences.</p>\n\n<p class=\"narrative\">Front pocket: your phone. 34% battery. Signal flickering in and out like a dying heartbeat. Minho's last words playing on loop in your head: <em>I'm coming for you.</em></p>\n\n<p class=\"narrative\">But Minho is in Itaewon. Forty minutes away on a good day, and today is not a good day. Today the streets are chaos and the phones are dying and the world has tilted on its axis in ways you don't understand.</p>\n\n<p class=\"narrative\">You can't wait for rescue. You won't.</p>\n\n<p class=\"narrative\">You stand at your front door. The baseball bat in your right hand, the knife sheathed at your hip in a belt you've repurposed from a leather jacket. You're wearing jeans, sneakers, a dark hoodie. Clothes you can run in. Clothes you can fight in. Clothes you can die in, if it comes to that.</p>\n\n<p class=\"narrative\">Behind the door: the hallway. Mrs. Park. The pounding that stopped ten minutes ago and the silence that came after, which is worse. So much worse. Because pounding means struggle, means someone's still fighting, but silence means—</p>\n\n<p class=\"narrative\">You don't finish the thought. You take a breath. Then another. Then you open the door.</p>\n\n<p class=\"narrative\">The hallway is empty. Almost.</p>\n\n<p class=\"narrative\">At the far end, near the elevator, something is slumped against the wall. A body. Not moving. From here you can't tell if it's dead or undead or just unconscious, but the pool of dark liquid spreading beneath it suggests that whatever happened, it's over.</p>\n\n<p class=\"narrative\">The emergency lights cast everything in red. The flickering makes shadows jump, makes your heart jump, makes you see movement where there is none. You force yourself to look. To really look.</p>\n\n<p class=\"narrative\">Mrs. Park's door is open. Just a crack. Enough to see darkness inside, to smell copper and rot drifting into the hallway like a warning.</p>\n\n<p class=\"narrative\">The stairwell door at the end of the hall hangs ajar. Beyond it: stairs going down to the lobby, to the streets, to whatever is happening out there. And stairs going up. To the roof. To high ground. To a view of the entire city.</p>\n\n<p class=\"narrative\">You have two choices. Down means facing whatever is in the streets. Minho is in Itaewon, northeast of here—if you're going to find him, you'll have to go through Seoul. Through whatever Seoul has become.</p>\n\n<p class=\"narrative\">Up means information. The roof of your building has a clear sightline in every direction. You could see the scope of it. Understand what you're dealing with. Plan.</p>\n\n<p class=\"narrative\">But up also means Mrs. Park. Means checking on the woman who's been feeding you for three years, who remembers your birthday, who sets a place at her table for a dead man.</p>\n\n<p class=\"narrative\">The hallway stretches in both directions. The slumped figure by the elevator doesn't move. The silence is absolute except for distant sounds—screaming, sirens, something that might be helicopter rotors or might just be your imagination.</p>\n\n<p class=\"narrative\">What do you do?</p>",
  "choices": [
    {
      "text": "Down. Through the slumped figure. Into the streets.",
      "target": "4_down",
      "flags": { "chose_streets": true, "bypassed_park": true }
    },
    {
      "text": "Up. To the roof. See what you're dealing with.",
      "target": "4_up",
      "flags": { "chose_highground": true, "tactical": true }
    },
    {
      "text": "Check Mrs. Park's apartment first. You can't leave without knowing.",
      "target": "4_check_park",
      "flags": { "loyalty": true, "chose_park": true }
    }
  ]
}
