{
  "id": "end_devoured",
  "title": "DEVOURED",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 20,
  "endingType": "death",
  "content": "<p class=\"narrative\">You don't see it coming.</p>\n\n<p class=\"narrative\">One moment you're running—through the alley, toward the light at the other end, toward whatever passes for safety in this broken world. The next moment something hits you from behind, and you're falling, and the pavement rushes up to meet your face with a crack that splits your vision into stars.</p>\n\n<p class=\"narrative\">You try to get up. Your arms won't cooperate. Something's wrong with your shoulder—dislocated, maybe, or broken—and the pain is a white-hot scream that drowns out everything else.</p>\n\n<p class=\"narrative\">Almost everything else.</p>\n\n<p class=\"narrative\">The sound behind you. Wet. Eager. Hungry.</p>\n\n<p class=\"narrative\">You roll over. Look up. See them.</p>\n\n<p class=\"narrative\">Three. Maybe four. It's hard to count when they're moving, when they're reaching, when their mouths are already opening and their fingers are already clawing at your clothes.</p>\n\n<p class=\"narrative\">The first bite is the worst. Not because of the pain—though the pain is extraordinary, a tearing sensation in your calf that redefines everything you thought you knew about suffering. The worst part is the sound. Your own flesh, separating. Your own blood, hitting pavement. Your own voice, screaming words that might be prayers or curses or just noise, the kind of noise an animal makes when it knows it's dying.</p>\n\n<p class=\"narrative\">They don't stop.</p>\n\n<p class=\"narrative\">You fight. Of course you fight. Your good arm swings, connects with something soft, sends one of them stumbling back. But there are more, always more, and your strength is leaving with your blood, pooling on the ground beneath you in a dark mirror of the sky above.</p>\n\n<p class=\"narrative\">The second bite takes something important. You feel it go—a piece of you that won't grow back, that will never be whole again. If you live. If living is still possible.</p>\n\n<p class=\"narrative\">It's not. You know it's not.</p>\n\n<p class=\"narrative\">But the mind does strange things when the body is failing. It retreats. Detaches. Watches from somewhere outside, somewhere safe, as if this is happening to someone else. As if you're just a spectator at your own ending.</p>\n\n<p class=\"narrative\">You think about Minho. Wonder if he's still looking for you. Wonder if he'll ever know what happened, or if you'll just be another disappearance in a city full of them. Another name that stops being spoken because there's no one left to speak it.</p>\n\n<p class=\"narrative\">You think about Mrs. Park. Her kindness. Her kimchi jjigae. The way she kept setting a place for a dead man, as if love could bridge the gap between here and gone. You hope she's somewhere better now. You hope she's with Taehyun.</p>\n\n<p class=\"narrative\">You hope there's a somewhere to be.</p>\n\n<p class=\"narrative\">The third bite doesn't register as pain anymore. Your body has given up translating the damage into sensation. Everything is distant, muffled, like watching a movie with the sound turned low.</p>\n\n<p class=\"narrative\">The sky is the wrong color. Gray and orange and something like purple at the edges where the sun is trying to set through the smoke. It's almost beautiful. If you could forget what's happening below it, you could almost call it beautiful.</p>\n\n<p class=\"narrative\">Your eyes close. Not by choice—the muscles just stop working, the commands from your brain getting lost somewhere in the wreckage of your nervous system.</p>\n\n<p class=\"narrative\">The last thing you feel is cold. Not the cold of December, but something deeper. Something final. The cold of a fire going out.</p>\n\n<p class=\"narrative\">You tried. That's something. In a world that stopped making sense, in a city that turned on itself, you tried to survive. You tried to help. You tried to find the people you loved and be found by them.</p>\n\n<p class=\"narrative\">It wasn't enough. But you tried.</p>\n\n<p class=\"narrative\">The darkness comes. You let it.</p>\n\n<p class=\"ending\">— DEVOURED —</p>\n<p class=\"ending\">Ending 20 of 13: Some stories don't have happy endings.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
