{
  "id": "end_jungwoo_search",
  "title": "BROKEN PROMISES",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 35,
  "endingType": "loss",
  "content": "<p class=\"narrative\">You find her.</p>\n\n<p class=\"narrative\">Jungwoo's fiancée. Minji. The woman in the photograph he's been clutching since you pulled him into the car, the woman whose name he couldn't stop saying, the woman he was supposed to marry next week in a ceremony that will never happen.</p>\n\n<p class=\"narrative\">She's in the apartment where he said she'd be. Third floor. The one with the yellow curtains and the plants on the balcony. You find the door open, the lock broken, the apartment beyond silent in the way only death can be silent.</p>\n\n<p class=\"narrative\">Jungwoo doesn't scream. Doesn't cry. Just stands in the doorway, looking at what's left of his future, making a sound you've never heard a human being make before—something between a moan and a whimper, something that comes from a place beyond language.</p>\n\n<p class=\"narrative\">She's on the couch. Still. Peaceful, almost. Whatever happened was fast—you can tell from the way she's positioned, from the lack of defensive wounds, from the single bite on her neck that must have caught an artery.</p>\n\n<p class=\"narrative\">She didn't turn. Small mercy. The blood loss was too fast, the death too quick for the infection to take hold. Whatever she is now, she's not one of them.</p>\n\n<p class=\"narrative\">Jungwoo walks to her. Kneels beside the couch. Takes her hand—cold now, stiff, not the hand he held on dates and proposals and all the moments that were supposed to lead to forever.</p>\n\n<p class=\"dialogue\">\"I was supposed to protect you.\"</p>\n\n<p class=\"narrative\">His voice is hollow. Empty. The voice of a man who's already given up on everything except this moment.</p>\n\n<p class=\"dialogue\">\"I was supposed to be here. I was at work. I was at WORK, and you—\"</p>\n\n<p class=\"narrative\">He breaks. Completely. Utterly. Sobs that rack his whole body, that shake the couch, that fill the apartment with grief so raw you can barely stand to witness it.</p>\n\n<p class=\"narrative\">You should leave. Give him privacy. Give him time to process what can't be processed, to grieve what can't be grieved. But you can't move. Can't look away. Can't do anything except stand in the doorway and feel your own losses echoing in his.</p>\n\n<p class=\"narrative\">Minho might be dead too. You don't know. Might never know. Might spend the rest of your life wondering if you could have saved him, if you should have gone to Itaewon, if different choices would have led to different endings.</p>\n\n<p class=\"narrative\">Jungwoo stops crying eventually. Not because he's done—you can see he'll never be done, not really—but because the body runs out of tears eventually. Runs out of sounds. Runs out of everything except the hollow shell of a person who used to be whole.</p>\n\n<p class=\"dialogue\">\"Go.\"</p>\n\n<p class=\"narrative\">He doesn't look at you when he says it.</p>\n\n<p class=\"dialogue\">\"I'm staying. With her. Until...\"</p>\n\n<p class=\"narrative\">He doesn't finish. Doesn't need to. You understand. Some endings aren't about survival. Some endings are about being there for the person you loved, even when being there means joining them.</p>\n\n<p class=\"narrative\">You leave him there. In the apartment with the yellow curtains. With the woman he was supposed to marry. With the future that was stolen before it could begin.</p>\n\n<p class=\"narrative\">The drive to the evacuation center is a blur. Tears and traffic and the constant weight of what you witnessed, what you couldn't prevent, what the world has become.</p>\n\n<p class=\"narrative\">You survive. Of course you survive. That's what you do now—survive while others don't, carry their memories like stones in your pockets, keep moving because stopping means drowning.</p>\n\n<p class=\"narrative\">But some part of you stays in that apartment. With Jungwoo. With Minji. With the promise of love that the apocalypse broke before it could be kept.</p>\n\n<p class=\"narrative\">You'll never know what happened to him. Whether he stayed until the end. Whether he found his own kind of peace.</p>\n\n<p class=\"narrative\">You hope he did. You hope they're together now, wherever together means.</p>\n\n<p class=\"narrative\">It's all you can hope for anymore.</p>\n\n<p class=\"ending\">— BROKEN PROMISES —</p>\n<p class=\"ending\">Ending 35 of 13: Some love stories don't get happy endings.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
