{
  "id": "end_together_escape",
  "title": "THE SURVIVORS",
  "thread": "minho",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 3,
  "endingType": "love",
  "content": "<p class=\"narrative\">You make it out together.</p>\n\n<p class=\"narrative\">The bridge is clear—barely, impossibly, a miracle of timing and luck and the desperate will to survive. Minho drives. You navigate. The Hyundai's engine screams as he pushes it past anything it was designed for, weaving between abandoned cars, over debris, through gaps that shouldn't exist.</p>\n\n<p class=\"narrative\">Seoul shrinks in the rearview mirror. The fires. The smoke. The city that raised you, that held your memories, that was supposed to be forever. It's dying, and you're leaving it behind, and the grief will come later but right now there's only the road and the man beside you and the desperate need to keep moving.</p>\n\n<p class=\"narrative\">You don't stop until you're past Suwon. Until the checkpoints are behind you. Until the military waves you through with exhausted eyes and points you toward the evacuation centers and you realize, finally, that you're going to live.</p>\n\n<p class=\"narrative\">The first night, you sleep in the car. Parked in a field off the highway, wrapped in emergency blankets, holding each other because neither of you can bear to let go. Minho cries. You cry. The kind of crying that empties you out and leaves something new in its place.</p>\n\n<p class=\"dialogue\">\"I should have stayed,\"</p>\n\n<p class=\"narrative\">he says, for the hundredth time.</p>\n\n<p class=\"dialogue\">\"You came back.\"</p>\n\n<p class=\"dialogue\">\"I should have never left.\"</p>\n\n<p class=\"dialogue\">\"You came back.\"</p>\n\n<p class=\"narrative\">That's the only answer that matters. The only answer you have.</p>\n\n<p class=\"narrative\">The evacuation center is chaos made orderly. Thousands of survivors, processed through tents, checked for bites, assigned cots in buildings that used to be schools and gyms and convention centers. You're together—they tried to separate you at first, men and women, but Minho held your hand and wouldn't let go and eventually they stopped trying.</p>\n\n<p class=\"narrative\">The days blur together. Waiting for news. Watching the lists of the dead grow longer. Learning that Mrs. Park's name appeared on day three, that your parents made it to Busan, that Minho's unit was wiped out in the first hours except for him.</p>\n\n<p class=\"narrative\">Survivor's guilt is a weight you carry together. Some days it's heavier than others. Some days you can barely get out of bed, and he holds you. Some days he can't speak, and you hold him. You take turns being strong.</p>\n\n<p class=\"narrative\">But you're alive. Both of you. Together.</p>\n\n<p class=\"narrative\">When the government starts rebuilding, when they ask for volunteers, you sign up together. Not because you're heroes—you're not, you're just two people who made it through—but because doing something is better than doing nothing. Because the dead would want you to keep going.</p>\n\n<p class=\"narrative\">You work in logistics. Minho works in security. You see each other at meals, at night, in the stolen moments between shifts. It's not romantic, most of the time. It's exhausted and scared and holding on to each other because letting go feels impossible.</p>\n\n<p class=\"narrative\">But sometimes—sometimes—there are moments.</p>\n\n<p class=\"narrative\">Three months in, on the rooftop of the building where you're both billeted, looking at stars you can finally see because there's no city light anymore, he asks you to marry him.</p>\n\n<p class=\"narrative\">No ring. No speech. Just the question, raw and simple.</p>\n\n<p class=\"dialogue\">\"Will you?\"</p>\n\n<p class=\"narrative\">You think about everything that led here. The phone call. The barricade. The choice to trust him when every instinct said not to. The six months of silence that almost cost you everything, and the apocalypse that gave you back to each other.</p>\n\n<p class=\"dialogue\">\"Yes.\"</p>\n\n<p class=\"narrative\">You get married in the evacuation center chapel. A military chaplain. Witnesses you barely know. Clothes borrowed from the donation pile. It's nothing like the wedding you once imagined—the dress, the venue, the carefully planned reception.</p>\n\n<p class=\"narrative\">It's better. Because it's real. Because it's you and him and the promise of a future in a world that almost didn't have one.</p>\n\n<p class=\"narrative\">Seoul is reclaimed, eventually. Rebuilt, slowly. You go back—together—and stand in front of your old apartment building. It's empty now. Condemned. Slated for demolition.</p>\n\n<p class=\"narrative\">But you remember. You both remember.</p>\n\n<p class=\"dialogue\">\"This is where it started,\"</p>\n\n<p class=\"narrative\">you say.</p>\n\n<p class=\"dialogue\">\"This is where we found each other again.\"</p>\n\n<p class=\"narrative\">He takes your hand. Squeezes. The ring on your finger catches the light—a simple band, bought with ration coupons, worth more than any diamond could ever be.</p>\n\n<p class=\"dialogue\">\"Let's go home.\"</p>\n\n<p class=\"narrative\">Home is somewhere else now. Somewhere new. But home is also wherever he is, wherever you are together, wherever the two of you can build something from the ashes.</p>\n\n<p class=\"narrative\">You survived. Both of you. Together.</p>\n\n<p class=\"narrative\">That's the only ending that matters.</p>\n\n<p class=\"ending\">— THE SURVIVORS —</p>\n<p class=\"ending\">Ending 3 of 13: You found each other in the end of the world. You built a new one together.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
