{
  "id": "end_itaewon_drive",
  "title": "THE REKINDLED FLAME",
  "thread": "minho",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 1,
  "endingType": "love",
  "content": "<p class=\"narrative\">You drive toward Itaewon.</p>\n\n<p class=\"narrative\">The streets fight you every meter. Abandoned cars form walls you have to navigate around. Bodies—some moving, some not—force detours that cost minutes you might not have. Twice you have to reverse, find another route, push through intersections that look impassable until you make them passable by force of will and accelerator.</p>\n\n<p class=\"narrative\">The Hyundai takes damage. A side mirror, lost to a collision with a motorcycle. A headlight, shattered against something you didn't see in time. The front bumper, hanging loose after you pushed through a barrier of shopping carts someone had erected across an alley.</p>\n\n<p class=\"narrative\">But you keep moving. Toward Itaewon. Toward him.</p>\n\n<p class=\"narrative\">The Hamilton Hotel rises against the smoke-dark sky. Six stories. Rooftop bar where expats used to drink overpriced cocktails and pretend they were somewhere more exciting than Seoul. Now the windows are dark, some broken, and something is moving on the third floor—shadows against firelight.</p>\n\n<p class=\"narrative\">You park. The street is quiet—too quiet. The kind of quiet that means everything that could make noise has already been silenced.</p>\n\n<p class=\"narrative\">The hotel lobby is chaos. Overturned furniture. Blood on the marble. A concierge desk with a body slumped behind it, head at the wrong angle. You don't look too closely. You move through, toward the stairs, toward the roof.</p>\n\n<p class=\"narrative\">Six flights. Each one could hide something. Each one could be the end. But you climb anyway, because Minho said rooftop, and Minho came back for you, and if there's even a chance—</p>\n\n<p class=\"narrative\">The rooftop door is barricaded from the inside. You knock. Once. Twice. Three times.</p>\n\n<p class=\"dialogue\">\"Minho?\"</p>\n\n<p class=\"narrative\">Silence. Then—shuffling. Something being moved. The door opens a crack, and an eye appears. Wild. Terrified. <em>His</em>.</p>\n\n<p class=\"dialogue\">\"Yuna?\"</p>\n\n<p class=\"narrative\">The door flies open. He's there. Bloody, exhausted, holding a fire axe like he's been ready to use it, but <em>alive</em>. Alive and looking at you like you're a hallucination, like you can't possibly be real, like the world doesn't work this way anymore.</p>\n\n<p class=\"dialogue\">\"You—I tried to come—the streets were—I couldn't—\"</p>\n\n<p class=\"narrative\">He's crying. This man who never cried, who held everything in, who walked away from you rather than admit he was breaking—he's crying, and you're crying, and somehow you're holding each other on the rooftop of a hotel in a city that's dying around you.</p>\n\n<p class=\"dialogue\">\"I found you.\"</p>\n\n<p class=\"narrative\">You say it into his shoulder, into the blood and sweat and terror of him.</p>\n\n<p class=\"dialogue\">\"I found you.\"</p>\n\n<p class=\"narrative\">He pulls back. Looks at you. Really looks, the way he used to before Tokyo, before the distance, before everything went wrong.</p>\n\n<p class=\"dialogue\">\"You came for me.\"</p>\n\n<p class=\"narrative\">It's not a question. It's wonder. It's gratitude. It's everything he couldn't say six months ago when he should have stayed.</p>\n\n<p class=\"dialogue\">\"You came back for me first.\"</p>\n\n<p class=\"narrative\">And then you're laughing, both of you, laughing at the absurdity of finding each other in the apocalypse, of all the ways this could have ended and didn't.</p>\n\n<p class=\"narrative\">Seoul burns below you. The world you knew is over. Nothing will ever be the same.</p>\n\n<p class=\"narrative\">But you're together. And somehow, impossibly, that's enough.</p>\n\n<p class=\"narrative\">The helicopter comes at dawn. Military. Evacuating survivors from rooftops across the city. You wave, and it sees you, and within the hour you're lifting off—away from the fire, away from the death, away from everything except each other.</p>\n\n<p class=\"narrative\">Minho holds your hand the entire flight. Doesn't let go. Won't let go. When the helicopter lands at the evacuation center in Pyeongtaek, when the medics check you over and pronounce you both uninfected, when the reality of survival finally sinks in—</p>\n\n<p class=\"narrative\">He still doesn't let go.</p>\n\n<p class=\"dialogue\">\"I'm not leaving again.\"</p>\n\n<p class=\"narrative\">He says it like a vow. Like a promise. Like the words he should have said in an airport six months ago.</p>\n\n<p class=\"dialogue\">\"I know.\"</p>\n\n<p class=\"narrative\">And you do. You finally, finally do.</p>\n\n<p class=\"ending\">— THE REKINDLED FLAME —</p>\n<p class=\"ending\">Ending 1 of 13: Love found in the ashes.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
