{
  "id": "end_yeouido_drive",
  "title": "THE DISPATCHER",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 2,
  "endingType": "duty",
  "content": "<p class=\"narrative\">Yeouido rises from the smoke like a fortress.</p>\n\n<p class=\"narrative\">The National Assembly building, that massive domed structure where politicians used to argue about budgets and scandals—it's become something else now. Military vehicles ring the perimeter. Sandbag walls. Razor wire. Soldiers in full gear, rifles trained on the approaches, shooting anything that moves wrong.</p>\n\n<p class=\"narrative\">You approach slowly. Hands visible. The Hyundai crawling forward at walking speed because sudden movements get you killed in this new world.</p>\n\n<p class=\"narrative\">A soldier waves you down. You stop. Roll down the window. Show your hands.</p>\n\n<p class=\"dialogue\">\"Are you bit?\"</p>\n\n<p class=\"dialogue\">\"No.\"</p>\n\n<p class=\"dialogue\">\"Anyone in the vehicle bit?\"</p>\n\n<p class=\"dialogue\">\"Just me. Not bit.\"</p>\n\n<p class=\"narrative\">He examines you. Neck. Arms. Eyes. Whatever he's looking for, he doesn't find it.</p>\n\n<p class=\"dialogue\">\"Park over there. Processing tent. You'll be quarantined for six hours. If you don't turn, you're in.\"</p>\n\n<p class=\"narrative\">Six hours. You can do six hours.</p>\n\n<p class=\"narrative\">The processing tent is chaos organized into rows. Survivors sitting on cots, waiting. Medics moving between them, checking vitals, marking clipboards. Children crying. Adults staring at nothing. The collective trauma of a city compressed into a canvas tent.</p>\n\n<p class=\"narrative\">You wait. You don't turn.</p>\n\n<p class=\"narrative\">When they let you out, the sun is setting. The sky is red—partly sunset, partly fire. Seoul is still burning, but here, inside the perimeter, there's something like order. Something like hope.</p>\n\n<p class=\"narrative\">A woman in military uniform approaches. Colonel's insignia. Hard eyes. The kind of person who's been making impossible decisions all day and will make more before it's over.</p>\n\n<p class=\"dialogue\">\"You drove here alone?\"</p>\n\n<p class=\"dialogue\">\"Yes.\"</p>\n\n<p class=\"dialogue\">\"From where?\"</p>\n\n<p class=\"dialogue\">\"Hannam. Through Itaewon. Through—\"</p>\n\n<p class=\"narrative\">She holds up a hand. Studies you.</p>\n\n<p class=\"dialogue\">\"You navigated from Hannam to Yeouido. Alone. In a civilian vehicle.\"</p>\n\n<p class=\"narrative\">It's not a question. It's an assessment.</p>\n\n<p class=\"dialogue\">\"We need people like you.\"</p>\n\n<p class=\"narrative\">She leads you to a command tent. Radios crackle. Maps cover every surface, marked with red zones and black X's and arrows showing evacuation routes that may or may not still exist.</p>\n\n<p class=\"dialogue\">\"We've lost contact with survivor groups across the city. Schools. Hospitals. Apartment complexes with people trapped on upper floors. We need someone who knows the streets. Who can guide rescue teams in.\"</p>\n\n<p class=\"narrative\">She hands you a headset. A map. A purpose.</p>\n\n<p class=\"dialogue\">\"You'll be their eyes. Their voice. The person who gets them home.\"</p>\n\n<p class=\"narrative\">You put on the headset. The radio crackles. Somewhere in the burning city, a rescue team is waiting for guidance.</p>\n\n<p class=\"narrative\">This isn't what you planned. This isn't finding Minho, or escaping to the mountains, or any of the futures you imagined in those first terrifying hours. But it's something. It's helping. It's making the end of the world slightly less ended for the people still trapped in it.</p>\n\n<p class=\"narrative\">You key the radio.</p>\n\n<p class=\"dialogue\">\"Rescue One, this is Dispatch. I have your route. Turn left on Seongsan-ro, avoid the interchange—it's blocked. There's an alley between the coffee shop and the parking garage. Take it slow. I'll guide you through.\"</p>\n\n<p class=\"narrative\">The response crackles back. Grateful. Alive.</p>\n\n<p class=\"narrative\">You spend the next three weeks in that tent. Eighteen-hour days. Hundreds of rescue operations. Thousands of survivors guided to safety through streets you've memorized, through routes you've improvised, through a city that's slowly being reclaimed one block at a time.</p>\n\n<p class=\"narrative\">Minho finds you on day nineteen. He made it to Pyeongtaek. Heard about the dispatcher who knew every street in Seoul. Put the pieces together.</p>\n\n<p class=\"narrative\">When he walks into the command tent, you're mid-operation. Guiding a team through Gangnam. You hold up a finger—<em>one minute</em>—and he waits. He understands.</p>\n\n<p class=\"narrative\">When the team is safe, when the radio goes quiet, you take off the headset.</p>\n\n<p class=\"dialogue\">\"You found me.\"</p>\n\n<p class=\"dialogue\">\"You were busy.\"</p>\n\n<p class=\"narrative\">He smiles. You smile. It's not the reunion you imagined. It's better.</p>\n\n<p class=\"narrative\">You have a job now. A purpose. A reason to survive beyond just surviving. And somewhere in the rubble of everything that fell apart, you've found something that actually matters.</p>\n\n<p class=\"ending\">— THE DISPATCHER —</p>\n<p class=\"ending\">Ending 2 of 13: You became the voice that guided them home.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
