{
  "id": "end_found_family",
  "title": "THE FOUND FAMILY",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 5,
  "endingType": "mercy",
  "content": "<p class=\"narrative\">The evacuation center becomes home.</p>\n\n<p class=\"narrative\">Not because you wanted it to—not because anyone wants to live in a converted convention center with five hundred other survivors, sharing bathrooms and rationed food and the collective trauma of a city that no longer exists. But because leaving means going somewhere, and you don't have anywhere to go anymore.</p>\n\n<p class=\"narrative\">Minho never made it out. You know this now. Confirmed by the lists they post every morning—the names of the confirmed dead, the names of the missing presumed gone. His name appeared on day twelve. You didn't cry. You'd already done your crying.</p>\n\n<p class=\"narrative\">But you're not alone.</p>\n\n<p class=\"narrative\">Jungwoo is here—the man you pulled into your car on that first terrible day, the almost-groom whose wedding never happened. His fiancée didn't make it either. You found each other in the meal line on day three, recognized the same hollow look in each other's eyes, and somehow started eating together. Then talking. Then just... being in the same space, because being alone felt worse.</p>\n\n<p class=\"narrative\">The professor's daughter found you on day eight. Dr. Yoon's daughter—twenty-six, studying abroad when it happened, flew back to Korea the moment the airports reopened. She came looking for anyone who might have seen her mother in those final hours. You had the keycard. You had the story. You gave her both.</p>\n\n<p class=\"narrative\">She stayed. Partly for answers, partly because she didn't have anywhere else to go. Her name is Eunji, and she has her mother's eyes, and sometimes when she talks about philosophy you can hear the professor's voice echoing in her words.</p>\n\n<p class=\"narrative\">Mrs. Park's daughter arrived on day fifteen. Soojin. You'd called her from the road, told her everything, and she'd driven up from Busan the moment the checkpoints opened. She brought her mother's old photo albums. You looked through them together—Mrs. Park as a young bride, as a new mother, as the woman who set a place for a dead man every night because love doesn't end.</p>\n\n<p class=\"narrative\">Soojin didn't blame you for surviving. Didn't ask why you made it when her mother didn't. Just hugged you and said <em>\"Thank you for being with her.\"</em></p>\n\n<p class=\"narrative\">She stayed too.</p>\n\n<p class=\"narrative\">By the end of the first month, you have a corner of the convention center that's become something like home. Four cots pushed together. A curtain someone rigged from old bedsheets. A collection of photographs that grows every week—Mrs. Park and Taehyun, the professor at her lectern, Jungwoo's fiancée on what would have been their wedding day, Minho in his military uniform from years ago that his mother brought when she found you.</p>\n\n<p class=\"narrative\">You didn't choose each other. The apocalypse chose you for each other. But somehow, impossibly, it works.</p>\n\n<p class=\"narrative\">Jungwoo makes you laugh—dark humor, the kind that only makes sense when you've seen what you've seen. Eunji makes you think—philosophy over instant noodles, debates about what it means to survive, to choose, to keep going. Soojin makes you remember—her mother's stories, her mother's kindness, the legacy of a woman who spent her last moments making sure you had a chance.</p>\n\n<p class=\"narrative\">When the government starts rebuilding, when they ask for volunteers to help reclaim the city, the four of you sign up together. Not because you're brave. Because you're stronger together than any of you are alone.</p>\n\n<p class=\"narrative\">The first building you clear is your old apartment complex. Fifteen floors of memories, now empty, being swept for survivors and threats. When you reach Mrs. Park's door—still open, still dark—Soojin takes your hand.</p>\n\n<p class=\"narrative\">Inside, everything is exactly as you remember. The broken vase. The blood on the floor. The kitchen where she handed you the gun and the keys and told you to survive.</p>\n\n<p class=\"narrative\">And on the table, undisturbed: two place settings. One for her. One for Taehyun.</p>\n\n<p class=\"narrative\">Soojin kneels down. Touches the chair where her father used to sit. When she looks up at you, she's crying, but she's also smiling.</p>\n\n<p class=\"dialogue\">\"She really did set it every night. I thought it was just something she said.\"</p>\n\n<p class=\"narrative\">You help her gather her mother's things. The photographs. The tea set. The wedding ring, still on the dresser where Mrs. Park left it the morning she died. All of it goes into boxes, into cars, into the new home you're building together—the four of you, the found family, the survivors who found each other in the wreckage.</p>\n\n<p class=\"narrative\">It's not the life you planned. It's not the future you imagined. But it's something. It's real. It's yours.</p>\n\n<p class=\"narrative\">And every night, in your new apartment—the one you share with people who understand—you set an extra place at the table.</p>\n\n<p class=\"narrative\">For Mrs. Park. For Minho. For everyone you lost and carry with you.</p>\n\n<p class=\"narrative\">Love doesn't end when the person does.</p>\n\n<p class=\"narrative\">You're learning what that means.</p>\n\n<p class=\"ending\">— THE FOUND FAMILY —</p>\n<p class=\"ending\">Ending 5 of 13: They weren't the family you chose. They became the family you needed.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
