{
  "id": "end_mrs_park_gift",
  "title": "MRS. PARK'S GIFT",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 32,
  "endingType": "loss",
  "content": "<p class=\"narrative\">She doesn't let you watch.</p>\n\n<p class=\"narrative\">When the moment comes—when you see her stumble, see her hand go to her head, see the first tremor of something wrong spreading through her body—she pushes you toward the car. Hard. Harder than an eighty-three-year-old woman should be able to push.</p>\n\n<p class=\"dialogue\">\"Go. GO.\"</p>\n\n<p class=\"narrative\">You go. You get in the Hyundai. You start the engine. And in the rearview mirror, you watch her turn toward the things that were hunting you—the three infected who found you in the garage, who were closing in before she stepped between them and the car.</p>\n\n<p class=\"narrative\">She has the knife from her kitchen. The big one. The one she used to cut vegetables for kimchi jjigae, to slice meat for bulgogi, to build all those meals she brought to your door because she knew you weren't eating properly.</p>\n\n<p class=\"narrative\">She's not running away. She's running toward them.</p>\n\n<p class=\"narrative\">You don't see what happens next. You're already accelerating, already taking the corner too fast, already escaping because that's what she wanted. What she demanded. The last gift she had to give.</p>\n\n<p class=\"narrative\">The drive to the bridge is a blur. Tears and traffic and the constant awareness that you're alone now, really alone, in a way you've never been before. No Mrs. Park bringing you soup. No Minho calling at midnight. No one waiting at home with a place set at the table.</p>\n\n<p class=\"narrative\">Just you. And her photograph. And the phone number of a daughter in Busan who doesn't know yet that her mother is gone.</p>\n\n<p class=\"narrative\">You make it out of Seoul. Through the checkpoint in Suwon. To the evacuation center in Pyeongtaek, where they check you for bites and give you a cot and tell you that you're safe now, as if safety means anything anymore.</p>\n\n<p class=\"narrative\">On the third day, you call the number.</p>\n\n<p class=\"narrative\">Soojin answers on the second ring. Her voice is her mother's voice—warm, practical, the voice of a woman who expects bad news and has learned to receive it with grace.</p>\n\n<p class=\"dialogue\">\"She's gone, isn't she?\"</p>\n\n<p class=\"narrative\">You tell her everything. About the pounding on the door. About Mr. Cho. About the bite that sealed her fate and the choice she made anyway—to help, to protect, to spend her last hours making sure a stranger survived.</p>\n\n<p class=\"narrative\">Soojin listens. Cries. Laughs once, when you mention the kimchi jjigae.</p>\n\n<p class=\"dialogue\">\"She was always feeding people. Couldn't stand to see anyone hungry.\"</p>\n\n<p class=\"narrative\">You tell her about the photograph. About the message—<em>love doesn't end when the person does</em>. About the place at the table that her father occupied even fifteen years after he was gone.</p>\n\n<p class=\"narrative\">The silence that follows is full of grief. Full of love. Full of all the things that words can't carry.</p>\n\n<p class=\"dialogue\">\"Thank you,\"</p>\n\n<p class=\"narrative\">Soojin says finally.</p>\n\n<p class=\"dialogue\">\"For being with her. For letting her go on her terms. For calling me.\"</p>\n\n<p class=\"narrative\">You stay on the phone until there's nothing left to say. Then longer. Then until Soojin has to go, has to keep living, has to start the long process of grieving a mother she wasn't there to save.</p>\n\n<p class=\"narrative\">You hang up. Look at the photograph one more time. Two women—Mrs. Park and Soojin—smiling at the camera on some ordinary day before everything changed.</p>\n\n<p class=\"narrative\">You survived because she chose to die. That's the math of it. The brutal equation of the new world.</p>\n\n<p class=\"narrative\">But you'll carry her with you. Set a place at your own table, metaphorically speaking. Remember the woman who brought you soup and called you dear and spent her last moments making sure you had a chance.</p>\n\n<p class=\"narrative\">Love doesn't end when the person does.</p>\n\n<p class=\"narrative\">You're starting to understand what that means.</p>\n\n<p class=\"ending\">— MRS. PARK'S GIFT —</p>\n<p class=\"ending\">Ending 32 of 13: She gave you everything. Don't waste it.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
