{
  "id": "end_turning",
  "title": "THE TURNING",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 22,
  "endingType": "death",
  "content": "<p class=\"narrative\">You don't remember being bitten.</p>\n\n<p class=\"narrative\">That's the thing that keeps circling through your mind as you sit on the rooftop, watching the sun set over a city that's already dead. You don't remember when it happened. Which fight. Which scramble through which hallway. Which moment of not-quite-fast-enough.</p>\n\n<p class=\"narrative\">But the bite is there. On your forearm, hidden under your sleeve for hours now. You saw it when you stopped to catch your breath, when you finally had a moment to check yourself, when the adrenaline faded enough for the pain to register.</p>\n\n<p class=\"narrative\">It's small. Almost nothing. A crescent of broken skin, barely bleeding, the kind of wound you'd put a bandage on and forget about in any other world.</p>\n\n<p class=\"narrative\">But this isn't any other world.</p>\n\n<p class=\"narrative\">You've been watching yourself for the past hour. Waiting for the symptoms you've heard about—the fever, the confusion, the hunger that replaces everything else. So far, nothing. Just the bite, and the knowledge of what it means, and the strange calm that comes from knowing the ending in advance.</p>\n\n<p class=\"narrative\">The gun is in your lap. Mrs. Park's husband's gun. Two bullets left. You used one in the garage, putting down something that was blocking the car. You have one for yourself, when the time comes. And one spare, just in case you miss.</p>\n\n<p class=\"narrative\">You won't miss.</p>\n\n<p class=\"narrative\">The city below is beautiful in its destruction. Fires paint the clouds orange and red, like a sunset that goes on forever. The Han River reflects the flames, turning the water into something that looks almost alive. If you didn't know what was happening—if you could forget, just for a moment—you might think it was art.</p>\n\n<p class=\"narrative\">You think about Minho. Wonder if he's still out there, still fighting, still looking for you. You hope he gave up. You hope he found another way out, another future that doesn't include finding your body on a rooftop with a gun in your hand.</p>\n\n<p class=\"narrative\">You think about Mrs. Park. The way she smiled when she gave you the gun, like she was passing on something precious. The way she said <em>\"Survive\"</em> like it was a blessing and a command.</p>\n\n<p class=\"narrative\">You tried. You really tried.</p>\n\n<p class=\"narrative\">The first tremor hits as the sun touches the horizon. Just a shiver, really—a flutter in your hands that could be cold, could be fear, could be nothing. But you know. Deep down, in the part of yourself that's still human, you know what it means.</p>\n\n<p class=\"narrative\">The clock is ticking. You have minutes now. Maybe less.</p>\n\n<p class=\"narrative\">You stand. Walk to the edge of the rooftop. Look down at the city—your city, the place where you were born, where you fell in love, where you thought you'd grow old. It's dying. You're dying. Everything is dying.</p>\n\n<p class=\"narrative\">But the sunset is beautiful. The air is cold and clean, up here above the smoke. And somewhere, somehow, there's still a world worth saving, even if you won't be part of it.</p>\n\n<p class=\"narrative\">You raise the gun. The metal is warm from your hand. The weight is familiar now, almost comforting.</p>\n\n<p class=\"narrative\">The second tremor comes. Stronger. Your vision blurs at the edges, and for just a moment, you feel something new—a hunger, deep and vast, that has nothing to do with food. It's them. It's what they feel. It's what you're becoming.</p>\n\n<p class=\"narrative\">Not yet. Not yet. You're still you. Still Yuna. Still the woman who loved and lost and tried to survive.</p>\n\n<p class=\"narrative\">You close your eyes. Think of Minho's face. Think of Mrs. Park's kindness. Think of every good thing that ever happened, every moment that made life worth living.</p>\n\n<p class=\"narrative\">Then you pull the trigger.</p>\n\n<p class=\"narrative\">The sound echoes across the rooftops. A single report, lost in the noise of a dying city. No one will hear it. No one will know.</p>\n\n<p class=\"narrative\">But you stayed human until the end. That has to count for something.</p>\n\n<p class=\"ending\">— THE TURNING —</p>\n<p class=\"ending\">Ending 22 of 13: You chose how it ended. That was the last thing you could choose.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
