{
  "id": "end_escape_drive",
  "title": "THE HERMIT",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 7,
  "endingType": "survival",
  "content": "<p class=\"narrative\">You drive south.</p>\n\n<p class=\"narrative\">Away from Minho. Away from the helicopters and the maybe-evacuation and the streets where things hunt in packs. Away from everyone you've ever known, everyone you've ever loved, everyone who might still be fighting to survive in the city you called home.</p>\n\n<p class=\"narrative\">You tell yourself it's the smart choice. The logical choice. The choice that keeps you breathing when so many others have stopped. But somewhere deep in the hollow space where your heart used to be, you know the truth.</p>\n\n<p class=\"narrative\">You're running.</p>\n\n<p class=\"narrative\">The bridges are chaos. The Hannam Bridge is blocked—a pile-up stretching back kilometers, cars abandoned, things moving between them like sharks in shallow water. You turn around, try the Banpo Bridge, find it worse. The Dongjak Bridge is burning.</p>\n\n<p class=\"narrative\">But the Noryangjin Bridge is clear. Somehow. Miraculously. A straight shot across the river to the highway that leads to—anywhere else. Anywhere that isn't here.</p>\n\n<p class=\"narrative\">You take it.</p>\n\n<p class=\"narrative\">The speedometer climbs. 60. 80. 100. The blue Hyundai wasn't built for speed, but it's trying, engine screaming, Mrs. Park's photograph sliding across the dashboard with every curve. You catch it. Tuck it into the sun visor where you can see it. Where she can watch over you.</p>\n\n<p class=\"narrative\">The city shrinks in the rearview mirror. The fires. The smoke. The helicopters that might be saving people or might just be watching them die. You don't look back. Can't look back. Looking back is the same as going back, and you can't—you <em>won't</em>—</p>\n\n<p class=\"narrative\">The highway is empty enough to move. You weave between abandoned cars, between bodies that might still be moving if you look too closely, between the wreckage of a world that ended while most of it was still asleep.</p>\n\n<p class=\"narrative\">Hours pass. The sun moves across a sky that's the wrong color. You stop once for gas—an abandoned station where the pumps still work, where you fill the tank and take every container you can find, where you don't look at the convenience store because something is moving inside and you don't have enough bullets for everything.</p>\n\n<p class=\"narrative\">By nightfall, you're in the mountains. A small road, barely paved, winding up into the Sobaeksan range. You find a cabin—empty, thank god, the owners fled or dead or somewhere in between. The door is unlocked. The pantry is stocked. The fireplace works.</p>\n\n<p class=\"narrative\">You barricade the doors. Check every window. Set up traps like you saw in a movie once, cans on strings, anything that might make noise if something tries to get in.</p>\n\n<p class=\"narrative\">And then you sit by the fire, alone, listening to the wind howl outside, wondering if Minho made it out. If anyone made it out. If survival means anything when you're the only one doing it.</p>\n\n<p class=\"narrative\">Days pass. Then weeks. The radio you find only brings static, then occasionally voices—military broadcasts, survivor camps, places you could go if you were brave enough to leave. You're not brave enough. You're not brave at all.</p>\n\n<p class=\"narrative\">But you're alive.</p>\n\n<p class=\"narrative\">Alive, and alone, and haunted by the choices you made and the people you left behind. Mrs. Park's ring weighs nothing on its chain around your neck, but somehow it gets heavier every day. The photograph in your pocket—her and Taehyun, young and in love—starts to feel like an accusation.</p>\n\n<p class=\"narrative\">You promised to survive. You kept that promise.</p>\n\n<p class=\"narrative\">You promised to tell her daughter about her. You never did.</p>\n\n<p class=\"narrative\">The winter comes. You have food. You have water. You have everything you need except the thing that made life worth living before the world ended.</p>\n\n<p class=\"narrative\">You have yourself. Just yourself. Forever.</p>\n\n<p class=\"narrative\">It's enough. It has to be enough.</p>\n\n<p class=\"narrative\">It's never going to be enough.</p>\n\n<p class=\"ending\">— THE HERMIT —</p>\n<p class=\"ending\">Ending 7 of 13: You survived. But at what cost?</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
