{
  "id": "end_professor_mercy",
  "title": "A MERCIFUL END",
  "thread": "yuna",
  "layer": 5,
  "isEnding": true,
  "endingNumber": 24,
  "endingType": "death",
  "content": "<p class=\"narrative\">She asks you to do it.</p>\n\n<p class=\"narrative\">Not with words—she's past words now, past the philosophy and the lectures and the careful articulation of a lifetime spent thinking about ethics. Just a look. A nod. A hand reaching for yours, guiding it toward the gun at your hip.</p>\n\n<p class=\"narrative\">The tremors are getting worse. Her eyes keep flickering—human, then something else, then human again. She's fighting it. Has been fighting it since you met her on this rooftop, since she handed you the keycard and told you about the lab and gave you purpose when you had none.</p>\n\n<p class=\"narrative\">But the fight is ending. You can see it. The way her fingers curl wrong. The way her breathing changes. The way she looks at you and for just a moment, just a fraction of a second, you see hunger instead of humanity.</p>\n\n<p class=\"dialogue\">\"Please.\"</p>\n\n<p class=\"narrative\">One word. Barely a whisper. The last coherent thing she'll ever say.</p>\n\n<p class=\"narrative\">You raise the gun. The metal is warm from being pressed against your body. Heavy. Real. The weight of a choice you never wanted to make.</p>\n\n<p class=\"narrative\">She smiles. It's the saddest smile you've ever seen—grateful and terrified and resigned all at once. The smile of someone who's made peace with an ending they can't escape.</p>\n\n<p class=\"dialogue\">\"Thank you,\"</p>\n\n<p class=\"narrative\">she mouths. No sound. Just the shape of the words.</p>\n\n<p class=\"narrative\">You pull the trigger.</p>\n\n<p class=\"narrative\">The sound is enormous. Bigger than you expected. It echoes across the rooftop, bounces off the water tanks, carries out over a city that's already full of gunshots and screams and the sounds of dying.</p>\n\n<p class=\"narrative\">She slumps. Peaceful. Human until the very end.</p>\n\n<p class=\"narrative\">You stand there for a long time. Minutes. Maybe longer. The wind blows ash across the rooftop and the sun continues its slow descent through smoke-colored clouds and somewhere below you Seoul keeps dying, keeps burning, keeps becoming something unrecognizable.</p>\n\n<p class=\"narrative\">The keycard is still in your pocket. The lab she mentioned. The answers that might be waiting.</p>\n\n<p class=\"narrative\">But you can't move. Can't think. Can't do anything except stare at the body of a woman whose name you never learned, whose last act was asking a stranger for mercy, whose final lecture was about the nature of humanity and whether any of it means anything when the veneer is stripped away.</p>\n\n<p class=\"narrative\">You gave her what she asked for. You don't know if that makes you a hero or a murderer or something in between.</p>\n\n<p class=\"narrative\">The tremor starts in your hands. Then your arms. Then your whole body, shaking so hard you can barely stay upright. The gun slips from your fingers, clatters on the concrete, and suddenly you're on your knees, sobbing, breaking in ways you didn't know you could break.</p>\n\n<p class=\"narrative\">You stay like that until the sun sets. Until the cold becomes unbearable. Until some survival instinct kicks in and drags you to your feet and points you toward the stairwell.</p>\n\n<p class=\"narrative\">The lab can wait. The answers can wait. Right now, you just need to survive long enough to feel human again.</p>\n\n<p class=\"narrative\">You're not sure you ever will.</p>\n\n<p class=\"ending\">— A MERCIFUL END —</p>\n<p class=\"ending\">Ending 24 of 13: Sometimes mercy is the hardest thing to give.</p>\n<p class=\"seed-display\">Your seed: [GENERATED]</p>",
  "choices": []
}
